#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp  :mkdirp yes :lexical t :exports code
#+PROPERTY: header-args:emacs-lisp+ :tangle ~/.emacs.d/init.el
#+property: header-args:emacs-lisp+ :mkdirp yes :noweb yes

**** Indentation
:PROPERTIES:
:CUSTOM_ID: Basic-configuration-Emacs-Behavior-Programming-Modes-Indentation
:END:
I don’t like tabs. They rarely look good, and if I need it I can almost always tell Emacs to use them through a .dir-locals.el file or through the config file of my code formatter. So by default, let’s disable them:
#+begin_src emacs-lisp
  (setq indent-tabs-mode nil)
  (add-hook 'prog-mode-hook (lambda () (setq indent-tabs-mode nil)))

#+end_src

#+RESULTS:
| (closure (t) nil (setq indent-tabs-mode nil)) | yas-minor-mode | display-line-numbers-mode | (lambda nil (setq indent-tabs-mode nil)) | hs-minor-mode |

:CUSTOM_ID: Basic-Configuration-Emacs-Behavior
:header-args:emacs-lisp: :tangle ~/.emacs.d/early-init.el :mkdirp yes
:header-args:emacs-lisp+: :exports code :results silent :lexical t
:END:

*** Programming Modes
:PROPERTIES:
:CUSTOM_ID: Basic-configuration-Emacs-Behavior-Programming-Modes
:END:
First off, my definition of what makes a “programming mode” doesn’t exactly
fit mine, so on top of ~prog-mode~, let’s add a few other modes.
#+name: line-number-modes-table
| Modes      |
|------------|
| prog-mode  |
| latex-mode |

#+name: prog-modes-gen
#+header: :cache yes :exports none :tangle no
#+begin_src emacs-lisp :var modes=line-number-modes-table
(mapconcat (lambda (mode) (format "%s-hook" (car mode)))
           modes
           " ")
#+end_src

#+RESULTS[427c457ba74530bb013e80aa28e15f5621f8e2c5]: prog-modes-gen
: prog-mode-hook latex-mode-hook

*** Stay Clean, Emacs!
:PROPERTIES:
:CUSTOM_ID: Basic-configuration-Emacs-Behavior-Stay-Clean-Emacs
:END:
As nice as Emacs is, it isn’t very polite or clean by default: open a
file, and it will create backup files in the same directory. But then,
when you open your directory with your favorite file manager and see
almost all of your files duplicated with a =~= appended to the filename,
it looks really uncomfortable! This is why I prefer to tell Emacs to
keep its backup files to itself in a directory it only will access.
#+begin_src emacs-lisp
(setq backup-directory-alist `(("." . ,(expand-file-name ".tmp/backups/"
                                                         user-emacs-directory))))
#+end_src

#+RESULTS:
: ((. . /home/void/.emacs.d/.tmp/backups/))

It also loves to litter its ~init.el~ with custom variables here and
there, but the thing is: I regenerate my ~init.el~ each time I tangle
this file! How can I keep Emacs from adding stuff that will be almost
immediately lost? Did someone say /custom file/?
#+begin_src emacs-lisp
(setq-default custom-file (expand-file-name ".custom.el" user-emacs-directory))
(when (file-exists-p custom-file) ; Don’t forget to load it, we still need it
  (load custom-file))
#+end_src

#+RESULTS:
: t

If we delete a file, we want it moved to the trash, not simply deleted.
#+begin_src emacs-lisp
(setq delete-by-moving-to-trash t)
#+end_src

#+RESULTS:
: t

Finally, the scratch buffer always has some message at its beginning, I
don’t want it!
#+begin_src emacs-lisp
(setq-default initial-scratch-message nil)
#+end_src

#+RESULTS:

*** Evil Snipe

#+begin_src emacs-lisp
  (ensure-package-installed 'evil-snipe)
  (require 'evil-snipe)
  (evil-snipe-mode 1)
  (evil-snipe-override-mode +1)
#+end_src

  ,#+RESULTS:
  : t

  ~undo-tree~ is my preferred way of undoing and redoing stuff. The main
  reason is it doesn’t create a linear undo/redo history, but rather a
  complete tree you can navigate to see your complete editing history.
  One of the two obvious things to do are to tell Emacs to save all its
  undo history fies in a dedicated directory, otherwise we’d risk
  littering all of our directories. The second thing is to simply
  globally enable its mode.

  ,#+begin_src emacs-lisp
    (ensure-package-installed 'undo-tree)
    (global-undo-tree-mode 1)

    (custom-set-variables
     '(undo-tree-history-directory-alist `(("." . ,(expand-file-name (file-name-as-directory "undo-tree-hist") user-emacs-directory)))))
    (setq undo-tree-visualizer-diff       t
            undo-tree-visualizer-timestamps t
            undo-tree-auto-save-history     t
            undo-tree-enable-undo-in-region t
            undo-limit        (* 800 1024)
            undo-strong-limit (* 12 1024 1024)
            undo-outer-limit  (* 128 1024 1024))
#+end_src

#+RESULTS:
: 134217728

* Visual Configuration
With Emacs 29.0.50 onwards, a new frame parameter exists:
~alpha-background~. Unlike ~alpha~, this frame parameter only makes Emacs’
background transparent, excluding images and text.
#+begin_src emacs-lisp
  (add-to-list 'default-frame-alist '(alpha-background . 0.7))
#+end_src

#+RESULTS:
: ((alpha-background . 0.7) (vertical-scroll-bars) (left-fringe . 10) (right-fringe . 10))

** Fonts
:PROPERTIES:
:CUSTOM_ID: Basic-configuration-Visual-Configuration-Fonts
:END:
I don’t like the default font I usually have on my machines, I really
don’t. I prefer [[https://github.com/microsoft/cascadia-code][~JetBrains Mono~]].
#+begin_src emacs-lisp
  (defvar my/default-font-size 150
    "Default font size.")

  ;; (defvar my/default-font-name "Iosevka Comfy Motion"
  ;;   "Default font.")

  (defvar my/default-font-name "Cascadia Code"
    "Default font.")

   ;; (defvar my/default-font-name "APL385 Unicode"
   ;;  "Default font.")

  (defun my/set-font ()
    (when (find-font (font-spec :name my/default-font-name))
      (set-face-attribute 'default nil
                          :font my/default-font-name
                          :height my/default-font-size)))

  (my/set-font)
  (add-hook 'server-after-make-frame-hook #'my/set-font)
#+end_src

#+RESULTS:
| my/set-font |

** Frame title
#+begin_src emacs-lisp
(setq frame-title-format
      '(""
        "%b"
        (:eval
         (let ((project-name (projectile-project-name)))
           (unless (string= "-" project-name)
             (format (if (buffer-modified-p) " ◉ %s" "  ●  %s - Emacs") project-name))))))
#+end_src

#+RESULTS:
|   | %b | (:eval (let ((project-name (projectile-project-name))) (unless (string= - project-name) (format (if (buffer-modified-p)  ◉ %s   ●  %s - Emacs) project-name)))) |

* Completion
Vertical completion i.e. when using find-file:
#+begin_src emacs-lisp
  (ensure-package-installed 'vertico)
  (when (require 'vertico nil :noerror)
    (require 'vertico-directory)
    (customize-set-variable 'vertico-cycle t)

    ;; Start vertico
    (vertico-mode 1))
#+end_src

#+RESULTS:
: t

[[https://en.wikipedia.org/wiki/Marginalia][Marginalia]] are marks or annotations placed at the margin of the
page of a book or in this case helpful colorful annotations placed at the margin
of the minibuffer for your completion candidates. Marginalia can only add
annotations to the completion candidates. It cannot modify the appearance of the
candidates themselves, which are shown unaltered as supplied by the original
command.

The annotations are added based on the completion category. For example
=find-file= reports the =file= category and =M-x= reports the =command= category. You
can cycle between more or less detailed annotators or even disable the annotator
with command =marginalia-cycle=.
#+begin_src emacs-lisp
  (ensure-package-installed 'marginalia)
  (when (require 'marginalia nil :noerror)
    (customize-set-variable 'marginalia-annotators
                            '(marginalia-annotators-heavy
                              marginalia-annotators-light
                              nil))
    (marginalia-mode 1))
#+end_src

#+RESULTS:
: t

[[https://github.com/oantolin/orderless][Orderless]]. An =orderless= /completion style/ that divides the
pattern into space-separated components, and matches candidates that
match all of the components in any order. Each component can match in
any one of several ways: literally, as a regexp, as an initialism, in
the flex style, or as multiple word prefixes. By default, regexp and
literal matches are enabled.
#+begin_src emacs-lisp
  (ensure-package-installed 'orderless)
  (when (require 'orderless nil :noerror)
    (customize-set-variable 'completion-styles '(orderless basic))
    (customize-set-variable 'completion-category-overrides
                            '((file (styles . (partial-completion))))))
#+end_src

#+RESULTS:
| file | (styles partial-completion) |

Embark makes it easy to choose a command to run based on what is near
point, both during a minibuffer completion session (in a way familiar
to Helm or Counsel users) and in normal buffers. Bind the command
=embark-act= to a key and it acts like prefix-key for a keymap of
/actions/ (commands) relevant to the /target/ around point. With point on
an URL in a buffer you can open the URL in a browser or eww or
download the file it points to. If while switching buffers you spot an
old one, you can kill it right there and continue to select another.
Embark comes preconfigured with over a hundred actions for common
types of targets such as files, buffers, identifiers, s-expressions,
sentences; and it is easy to add more actions and more target types.
Embark can also collect all the candidates in a minibuffer to an
occur-like buffer or export them to a buffer in a major-mode specific
to the type of candidates, such as dired for a set of files, ibuffer
for a set of buffers, or customize for a set of variables.
#+begin_src emacs-lisp
  (ensure-package-installed 'embark)
  (when (require 'embark nil :noerror)

    (keymap-global-set "<remap> <describe-bindings>" #'embark-bindings)
    (keymap-global-set "C-." 'embark-act)

    ;; Use Embark to show bindings in a key prefix with `C-h`
    (setq prefix-help-command #'embark-prefix-help-command)

    (when (require 'embark-consult nil :noerror)
      (with-eval-after-load 'embark-consult
        (add-hook 'embark-collect-mode-hook #'consult-preview-at-point-mode))))
#+end_src

#+RESULTS:

[[https://github.com/minad/corfu][Corfu]]. Corfu enhances in-buffer completion with a small completion popup. The current
candidates are shown in a popup below or above the point. The candidates can be
selected by moving up and down. Corfu is the minimalistic in-buffer completion
counterpart of the [[https://github.com/minad/vertico][Vertico]] minibuffer UI.
#+begin_src emacs-lisp
  (ensure-package-installed 'corfu)
  (when (require 'corfu nil :noerror)

    (unless (display-graphic-p)
      (when (require 'corfu-terminal nil :noerror)
        (corfu-terminal-mode +1)))

    ;; Setup corfu for popup like completion
    (customize-set-variable 'corfu-cycle t) ; Allows cycling through candidates
    (customize-set-variable 'corfu-auto t)  ; Enable auto completion
    (customize-set-variable 'corfu-auto-prefix 2) ; Complete with less prefix keys

    (global-corfu-mode 1)
    (when (require 'corfu-popupinfo nil :noerror)

      (corfu-popupinfo-mode 1)
      (eldoc-add-command #'corfu-insert)
      (keymap-set corfu-map "M-p" #'corfu-popupinfo-scroll-down)
      (keymap-set corfu-map "M-n" #'corfu-popupinfo-scroll-up)
      (keymap-set corfu-map "M-d" #'corfu-popupinfo-toggle)))
#+end_src

#+RESULTS:
: corfu-popupinfo-toggle

[[https://github.com/minad/cape/tree/main][Cape]] provides Completion At Point Extensions which can be used in combination
with [[https://github.com/minad/corfu][Corfu]], [[https://github.com/company-mode/company-mode][Company]] or the default completion UI. The completion backends used
by ~completion-at-point~ are so called ~completion-at-point-functions~ (Capfs).
#+begin_src emacs-lisp
  (ensure-package-installed 'cape)
  (when (require 'cape nil :noerror)
    ;; Setup Cape for better completion-at-point support and more

    ;; Add useful defaults completion sources from cape
    (add-to-list 'completion-at-point-functions #'cape-file)
    (add-to-list 'completion-at-point-functions #'cape-dabbrev)

    ;; Silence the pcomplete capf, no errors or messages!
    ;; Important for corfu
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)

    ;; Ensure that pcomplete does not write to the buffer
    ;; and behaves as a pure `completion-at-point-function'.
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify))
#+end_src

#+RESULTS:

* IDE settings

The package [[https://github.com/editorconfig/editorconfig-emacs][editorconfig]] is a cross-editor/ide configuration tool to control
indentation, spaces vs tabs, etc., while [[https://elpa.gnu.org/packages/aggressive-indent.html][aggressive-indent]] is a minor mode to always keep your code indented while editing blocks of code.
As most development is done on projects, add [[https://melpa.org/#/ibuffer-project][ibuffer-project]] to
group project buffers together when listing buffers with ibuffer.
#+begin_src emacs-lisp
  (ensure-package-installed 'editorconfig 'aggressive-indent 'ibuffer-project)
  (defun add-eglot-hooks (mode-list)
    "Add `eglot-ensure' to modes in MODE-LIST.

  The mode must be loaded, i.e. found with `fboundp'. A mode which
  is not loaded will not have a hook added, in which case add it manually
  with something like this:

  `(add-hook 'some-mode-hook #'eglot-ensure)'"
    (dolist (mode-def mode-list)
      (let ((mode (if (listp mode-def) (car mode-def) mode-def)))
        (cond
         ((listp mode) (add-eglot-hooks mode))
         (t
          (when (and (fboundp mode)
                     (not (eq 'clojure-mode mode))
                     (not (eq 'lisp-mode mode))
                     (not (eq 'scheme-mode mode))
                     )
            (let ((hook-name (format "%s-hook" (symbol-name mode))))
              (message "adding eglot to %s" hook-name)
              (add-hook (intern hook-name) #'eglot-ensure))))))))


  (with-eval-after-load "eglot"
    (add-eglot-hooks eglot-server-programs))
#+end_src

#+RESULTS:

[[https://elpa.gnu.org/packages/kind-icon.html][kind-icon]] adds an colorful icon or text prefix based on
:company-kind for compatible completion UI's.  The "kind" prefix is
typically used for differentiating completion candidates such as
variables, functions, etc.
#+begin_src emacs-lisp
  (ensure-package-installed 'kind-icon)
  (custom-set-faces '(kind-icon-default-face corfu-default))
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter)
#+end_src

#+RESULTS:
| kind-icon-margin-formatter |

** Visual Configuration
:PROPERTIES:
:CUSTOM_ID: Org-Mode-Settings-Visual-Configuration
:END:
I have an issue with org-mode’s emphasis markers: I find them ugly.
I can of course hide them if I simply set ~org-hide-emphasis-markers~ to ~t~, but it makes
editing hard since I never know whether I am before or
after the emphasis marker when editing near the beginning/end of an emphasized region.
org-appear fixes this issue so that it shows the emphasis markers only when
the cursor is in the emphasized region, otherwise they will remain hidden! Very cool!
I Also want a more modern look for ~org-mode~, so lets's enable ~org-modern~.
#+begin_src emacs-lisp
  (ensure-package-installed 'org-appear)

  (setq org-appear-autoemphasis t
        org-hide-emphasis-markers t
        org-appear-autolinks t
        org-appear-autoentities t
        org-appear-autosubmarkers t)

  (ensure-package-installed 'org-modern)
  (add-hooks-pair '(org-mode) '(org-appear-mode org-modern-mode))
#+end_src

#+RESULTS:

For my personal configuration I decided to hide source-code-blocks in org-mode per default.

#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-hide-block-all)
#+end_src

#+RESULTS:
| org-hide-block-all | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-modern-mode | org-appear-mode |

